app/controllers/blocks_controller.rb

SELECT "blocks".* FROM "blocks" WHERE "blocks"."story_id" = 1 AND "blocks"."block_number" IS NULL LIMIT 1
---
  def show
    @block = Story.find_by_id(params[:story_id]).blocks.find_by_block_number(params[:block_id])