app/controllers/blocks_controller.rb

  def index
    if (params[:first_block].nil? or params[:last_block].nil?)
      @block = Story.find_by_id(params[:story_id]).blocks.find_by_block_number(params[:id])
      render_success({:block => @block})
    else
      @blocks = Story.find_by_id(params[:story_id]).blocks.where(:block_number => params[:first_block]..params[:last_block])
      render_success(@blocks.map { |b| {:block => b }})
---
SELECT "blocks".* FROM "blocks" WHERE "blocks"."story_id" = 2 AND ("blocks"."block_number" BETWEEN 1 AND 5)
SELECT "stories".* FROM "stories" WHERE "stories"."id" = 2 LIMIT 1